In [1]:
from sqlalchemy import create_engine, text
import geopandas as gpd
import pandas as pd

First, we need to create a connection string. The format is

 ```<dialect(+driver)>://<username>:<password>@<hostname>:<port>/<database>```

In [2]:
database_name = 'scooters'# Fill this in with your database name 

connection_string = f"postgresql://postgres:postgres@localhost:5433/{database_name}"

In [3]:
connection_string

'postgresql://postgres:postgres@localhost:5433/scooters'

Now, we need to create an engine and use it to connect.

In [4]:
engine = create_engine(connection_string)

In [5]:
engine

Engine(postgresql://postgres:***@localhost:5433/scooters)

Now, we can create our query and pass it into the `.query()` method.

In [6]:
query = '''
SELECT *
FROM scooters 
LIMIT 10;
'''

with engine.connect() as connection:
    result = connection.execute(text(query))

In [7]:
result.fetchone()

(datetime.datetime(2019, 7, 26, 14, 9, 39, 97000), Decimal('36.154054'), Decimal('-86.784561'), 'PoweredQ4TQR', 'Powered', Decimal('99.00'), 'scooter', Decimal('0.15'), 'Bird')

In [8]:
query = '''
SELECT * 
FROM scooters
LIMIT 100;
'''

with engine.connect() as connection:
    scooters_query = pd.read_sql(text(query), con = connection)

scooters_query.head()

,pubdatetime,latitude,longitude,sumdid,sumdtype,chargelevel,sumdgroup,costpermin,companyname
0,2019-07-26 14:09:39.097,36.154054,-86.784561,PoweredQ4TQR,Powered,99.0,scooter,0.15,Bird
1,2019-07-26 14:09:39.097,36.160008,-86.774830,PoweredV91CS,Powered,100.0,scooter,0.15,Bird
2,2019-07-26 14:09:39.097,36.141218,-86.800378,PoweredG1L51,Powered,79.0,scooter,0.15,Bird
3,2019-07-26 14:09:39.097,36.163030,-86.780210,Powered9VGFW,Powered,97.0,scooter,0.15,Bird
4,2019-07-26 14:09:39.097,36.147557,-86.808362,PoweredT6NDD,Powered,91.0,scooter,0.15,Bird

## Uploading Using SQLAlchemy
#use this format to directly load the dataframes from SQL (do this 7 more times - filter scooters by company name): 

query = '''
SELECT *
FROM trips;
'''
with engine.connect() as connection:
    tripsdf = pd.read_sql(text(query), con = connection)
tripsdf.head()

#then turn each query into a csv: 
trips.to_csv("tripsdf.csv", index=False)

## Reading all files as csv's (smallest to largest):

In [9]:
tripsdf = pd.read_csv('data/tripsdf.csv')

In [10]:
boltdf = pd.read_csv('data/boltdf.csv')

In [11]:
gotchadf = pd.read_csv('data/gotchadf.csv')

In [12]:
spindf = pd.read_csv('data/spindf.csv')

In [13]:
lyftdf = pd.read_csv('data/lyftdf.csv')

In [14]:
birddf = pd.read_csv('data/birddf.csv')

In [15]:
limedf = pd.read_csv('data/limedf.csv')

In [16]:
jumpdf = pd.read_csv('data/jumpdf.csv')

## Now combine the dataframes to recreate the scooters table as a dataframe:

In [17]:
#Create a list will all the data frames, then concatenate it and define it as "scootersdf"
scooters_list = [birddf, boltdf, gotchadf, jumpdf, limedf, lyftdf, spindf]
scootersdf = pd.concat(scooters_list)

In [19]:
scootersdf.head()

,pubdatetime,latitude,longitude,sumdid,sumdtype,chargelevel,sumdgroup,costpermin,companyname
0,2019-07-30 17:37:28.870,36.141562,-86.806655,PoweredVAW9Y,Powered,95.0,scooter,0.15,Bird
1,2019-07-30 17:37:28.870,36.159744,-86.780067,PoweredSNB79,Powered,58.0,scooter,0.15,Bird
2,2019-07-30 17:37:28.870,36.153569,-86.784961,PoweredZY5KX,Powered,100.0,scooter,0.15,Bird
3,2019-07-30 17:37:28.870,36.155984,-86.782756,PoweredPHVAG,Powered,100.0,scooter,0.15,Bird
4,2019-07-30 17:37:28.870,36.147253,-86.815000,Powered238ZE,Powered,76.0,scooter,0.15,Bird

Metro Scooters Analysis
In May of 2018, Bird dropped hundreds of scooters on the streets of Nashville with no permission. In response, Metro sued, which caused Bird to remove and wait for permits. Metro began developing regulations for scooters and other shared urban mobility devices (SUMDs). In 2019, the Metro Council passed legislation enacting a one-year pilot program for scooters. For this project, you have been provided with the data for 3 months of this pilot program with the goal of reporting on usage trends and generating recommendations for quantity and distribution of scooters in Nashville.

Metro would like to know what the ideal density of available scooters is, which balances the objectives of enabling scooters to serve transportation goals, discouraging scooters from piling up on sidewalks, keeping it economically viable for companies to operate equitably in the city.

This data for this project can be downloaded as a Postgres backup from https://drive.google.com/file/d/1BXAfByFvHCwX0G1BvTCQ373qKm7wE4Y-/view?usp=share_link.

Some notes about the data:

When not in use, each scooter will report its location every five minutes. This data is contained in the scooters table.
WARNING: Both tables contain a large number of records, so think carefully about what data you need to pull in a given query. If you try and pull in all rows from the scooters table, there is a very good chance that you will crash your notebook!

# Exploratory Analysis Questions:

## Are there any null values in any columns in either table?

In [20]:
#Check for null values in the scooters table/DF: 
scootersdf.isna().any()

pubdatetime    False
latitude       False
longitude      False
sumdid         False
sumdtype       False
chargelevel     True
sumdgroup      False
costpermin     False
companyname    False
dtype: bool

In [21]:
tripsdf.isna().any()

pubtimestamp      False
companyname       False
triprecordnum     False
sumdid            False
tripduration      False
tripdistance      False
startdate         False
starttime         False
enddate           False
endtime           False
startlatitude     False
startlongitude    False
endlatitude       False
endlongitude      False
triproute         False
create_dt         False
dtype: bool

#### Answer: The only NULL values are in the charge level from the trips table

## What date range is represented in each of the date columns? Investigate any values that seem odd.

In [23]:
#change the date columns in scooters and trips dataframes to be datetime formats
scootersdf['pubdatetime'] = pd.to_datetime(scootersdf['pubdatetime'], format = 'mixed')
tripsdf['pubtimestamp'] = pd.to_datetime(tripsdf['pubtimestamp'], format = 'mixed')

In [25]:
scooters_table_date_range = 'Date range for scooters table: ' + str(scootersdf['pubdatetime'].dt.date.min()) + ' to ' +str(scootersdf['pubdatetime'].dt.date.max())
print(scooters_table_date_range)

Date range for scooters table: 2019-05-01 to 2019-07-31

In [26]:
trips_table_date_range = 'Date range for trips table: ' + str(tripsdf['pubtimestamp'].dt.date.min()) + ' to ' +str(tripsdf['pubtimestamp'].dt.date.max())
print(trips_table_date_range)

Date range for trips table: 2019-05-01 to 2019-08-01

#### Answer: The date range for both tables is May-July (trips table includes one day of August)

## Is time represented with am/pm or using 24 hour values in each of the columns that include time?

In [32]:
#scooters table has 24 hour timestamp in pubdatetime column
scootersdf.head()

,pubdatetime,latitude,longitude,sumdid,sumdtype,chargelevel,sumdgroup,costpermin,companyname
0,2019-07-30 17:37:28.870,36.141562,-86.806655,PoweredVAW9Y,Powered,95.0,scooter,0.15,Bird
1,2019-07-30 17:37:28.870,36.159744,-86.780067,PoweredSNB79,Powered,58.0,scooter,0.15,Bird
2,2019-07-30 17:37:28.870,36.153569,-86.784961,PoweredZY5KX,Powered,100.0,scooter,0.15,Bird
3,2019-07-30 17:37:28.870,36.155984,-86.782756,PoweredPHVAG,Powered,100.0,scooter,0.15,Bird
4,2019-07-30 17:37:28.870,36.147253,-86.815000,Powered238ZE,Powered,76.0,scooter,0.15,Bird

In [34]:
#trips table has more columns, and they are all in 24 hour time format as well 
tripsdf.tail()

,pubtimestamp,companyname,triprecordnum,sumdid,tripduration,tripdistance,startdate,starttime,enddate,endtime,startlatitude,startlongitude,endlatitude,endlongitude,triproute,create_dt
565517,2019-08-01 04:53:48,JUMP,JMP3,Powered5614e4fc-1971-5e5c-a545-0fd88cd3331d,17.497950,7075.2,2019-07-31,23:47:43,2019-08-01,00:05:13,36.154633,-86.798340,36.149220,-86.813980,"[('36.154631', '-86.798341'), ('36.154631', '-...",2019-08-02 08:21:27.127
565518,2019-08-01 04:53:48,JUMP,JMP2,Powereda4712099-5e55-5332-996c-d6e5c910535d,3.154917,1320.0,2019-07-31,23:57:19,2019-08-01,00:00:28,36.153015,-86.783585,36.152843,-86.779594,"[('36.153016', '-86.783586'), ('36.153016', '-...",2019-08-02 08:21:26.773
565519,2019-08-01 04:53:48,JUMP,JMP1,Poweredb8a3a269-d1ca-571f-9b2f-89b7399b5537,18.440650,7920.0,2019-07-31,23:41:52,2019-08-01,00:00:18,36.153687,-86.784580,36.164158,-86.776900,"[('36.153685', '-86.784578'), ('36.153685', '-...",2019-08-02 08:21:26.803
565520,2019-08-01 07:04:00,JUMP,JMP35,Poweredf077a919-d569-5e70-8ca7-71d179ffacf9,142.345610,20433.6,2019-07-31,23:26:15,2019-08-01,01:48:35,36.155735,-86.775185,36.173904,-86.785450,"[('36.155736', '-86.775181'), ('36.155531', '-...",2019-08-02 08:24:21.967
565521,2019-08-01 07:04:00,JUMP,JMP34,Powered784fcc92-bd1a-5f6a-8314-b02aa21b4bfa,209.409650,14889.6,2019-07-31,22:19:08,2019-08-01,01:48:33,36.160050,-86.776720,36.163410,-86.782100,"[('36.160051', '-86.77672'), ('36.160051', '-8...",2019-08-02 08:24:22.000

##### Answer: both are in 24 hour time

## What values are there in the sumdgroup column? Are there any that are not of interest for this project?

In [35]:
scootersdf.value_counts(subset='sumdgroup')

sumdgroup
scooter    59671463
Scooter    13716051
bicycle       26529
Name: count, dtype: int64

#### Answer: There is no need to have the bicycle group

## What are the minimum and maximum values for all the latitude and longitude columns? Do these ranges make sense, or is there anything surprising?

In [37]:
#Query min/max lat and long values from the scooters table
query = '''
SELECT min(longitude) as min_long, min(latitude) as min_lat, max(longitude) as max_long, max(latitude) as max_lat
FROM scooters;
'''

with engine.connect() as connection:
    scooters_long_lat_range = pd.read_sql(text(query), con = connection)

scooters_long_lat_range.head()

    min_long  min_lat  max_long       max_lat
0 -97.443879      0.0       0.0  3.609874e+06

In [39]:
#Query min/max starting lat and long values from the trips table
query = '''
SELECT min(startlongitude) as min_long, min(startlatitude) as min_lat, max(startlongitude) as max_long, max(startlatitude) as max_lat
FROM trips;
'''

with engine.connect() as connection:
    trips_start_long_lat_range = pd.read_sql(text(query), con = connection)

trips_start_long_lat_range.head()

    min_long  min_lat  max_long    max_lat
0 -86.918008  35.8532  -86.3662  36.300029

In [40]:
#Query min/max ending lat and long values from the trips table
query = '''
SELECT min(endlongitude) as min_long, min(endlatitude) as min_lat, max(endlongitude) as max_long, max(endlatitude) as max_lat
FROM trips;
'''

with engine.connect() as connection:
    trips_end_long_lat_range = pd.read_sql(text(query), con = connection)

trips_end_long_lat_range.head()

     min_long    min_lat    max_long    max_lat
0 -122.673729 -36.850405  174.764886  51.045409

#### Answer: some values in the scooters table are 0, which are outside the range of Nashville. Also in the trips table the end longitude range is much wider than it should be. I could test this with geopandas but I don't have time

## What is the range of values for trip duration and trip distance? Do these values make sense? Explore values that might seem questionable.

In [41]:
#Query min/max tripduration and tripdistance values from the trips table
query = '''
SELECT min(tripduration) as min_duration, max(tripduration) as max_duration, min(tripdistance) as min_distance, max(tripdistance) as max_distance
FROM trips;
'''

with engine.connect() as connection:
    trips_duration_and_distance_range = pd.read_sql(text(query), con = connection)

trips_duration_and_distance_range.head()

   min_duration  max_duration  min_distance  max_distance
0    -19.358267      512619.0   -20324803.8  3.188448e+07

#### Answer: Some of the numbers are negative

## Check out how the values for the company name column in the scooters table compare to those of the trips table. What do you notice?

#### Answer: some of the names have alternative spellings on each table

distinct company names in both tables: 

"Bird"

"Bolt"
"Bolt Mobility"

"Gotcha"

"Jump"
"JUMP"

"Lime"

"Lyft"

"Spin"
"SPIN"

# Focus Questions

## 1. During this period, seven companies offered scooters. How many scooters did each company have in this time frame? Did the number for each company change over time? Did scooter usage vary by company?